# ------------------------------------------------------------------------------------------------
# 1. 어떤 클래스 => 클래스명
# 2. 특징/성격/외형/속성 => 변수 : 속성(attribute),필드(field)
# 3. 기능/역할/행동 => 클래스 전용 함수 : 메서드(method)
# ------------------------------------------------------------------------------------------------
# 휴대폰 클래스
# ------------------------------------------------------------------------------------------------
# 전화, 문자, 사진, 음악, 네비, 배터리, 번호, 기종, 브랜드, 색상, 웹서핑, 폴더블
# ------------------------------------------------------------------------------------------------
class Mobile:
    #클래스 속성

    #인스턴스 속성
    def __init__(self,num,brand,model,color):
            self.num=num
            self.brand=brand
            self.model=model
            self.color=color
    
    #인스턴스 메서드
    def call(self,number): print(f'{number}에 전화 연결')
    def mms(self,number,text): print(f'To.{number}\n{text}\nFrom.{self.num} ')
    def navi(self,end): print(f'현위치에서 {end}까지 길 안내')    
myPhone=Mobile()











